[
  {
    "des": "A Windows 98-themed website evokes nostalgia by recreating the classic look and feel of the operating system. It features a retro interface with a Start menu, taskbar, and draggable pop-up windows that replicate the iconic blue-and-grey color scheme. This site combines the playful design with interactive nostalgia, offering a fun trip back to the late 90s tech aesthetic. This website is coded in pure vanilla js. The only libraries used are expressjs for routing and a 2FA Authenticator code generator. I made this when I was 15 years old, and this was my first major project. I had a lot of fun making it. You can use the following credentials to test it: Username: ezio, OTP: 526915.",
    "tit": "WIN98 SHOWCASE WEBSITE",
    "git": "https://github.com/hello-lab/windows98-portfolio",
    "link": "https://win98.niyogi.hackclub.app",
    "id": "win98",
    "lang": "nodejs"
  },
  {
    "des": "This website was made for Calcutta Internation School Hackathon in 3hours time, the topic being social good. It secured third position among 15 other schools. It uses the scroll event listener to create a beautiful animation on the landing page. Its written in pure js. I also template function to increase code reuse and to save time. The main theme of it is to promote 'HARVEST HOPE INITIATIVE' which is NGO which aims to make healthy food a birth right for everyone. It has volunteer signup forms and a gallery of the past projects done by the organization it even has a page containing resources related food wastage. I also came up with an innovative idea to promote the organization. If users shared screenshots of our webpage to their story, we will put their name on our food packets.",
    "tit": "HARVEST HOPE INITIATIVE WEBSITE",
    "git": "https://github.com/hello-lab/HARVEST-HOPES-INITIATIVE",
    "link": "https://hhi.niyogi.hackclub.app",
    "id": "hhi",
    "lang": "nodejs"
  },
  {
    "des": "This was made for class 12 CBSE project. It is written in Python and uses MySql as database, Flask as webserver.program aims at connecting computers to each other to have better monitoring of multiple computers with just one computer. It checks for any programs running on the client computer that is not included in the whitelist and sends a prompt to the server computer informing the same. It has two parts one is the server and one is the client. The server listens for client connection and shows relevant information on the website. For the client first the config.py is run to create the whitelist, the config.py must be deleted after that. After the configuration of the whitelist is done, the main.py is run, where the input is the ip of the server along with the computer name to be given. This software is majorly for schools or institutions where only few programs are allowed to run. ",
    "tit": "PROCESS MONITORING SYSTEM",
    "git": "https://github.com/hello-lab/process-monitoring-system",
    "link": "https://uno.niyogi.hackclub.app",
    "id": "process",
    "lang": "python"
  },
  {
    "des": "This website was made for St Xaviers' 3day Hackathon (secured 2nd postion), the topic was educational platform . Brainiac is an innovative educational platform offering expertly curated courses and personalized learning paths for learners of all ages. Designed for school and college students, as well as individuals seeking to enhance specific skills, Brainiac provides a comprehensive and engaging learning experience. Features include interactive content such as videos, quizzes, and simulations, live classes, adaptive learning algorithms, and community support through discussion forums and study groups. Brainiac also offers progress tracking, accredited certifications, and career services, making it a one-stop solution for effective and enjoyable learning.Brainiac has been developed as a full stack web application, which is completely responsive in order to make it accessible to all sectors of learners. It is powered by a robust and type-safe Django backend designed in the Python Programming Language which allows us to seamlessly integrate and organize our code base without going through the hassle of segregating web components. On the frontend, we have used TailwindCSS in order to deliver finesse in design",
    "tit": "BRAINIAC",
    "git": "https://github.com/hello-lab/Brainiac",
    "link": "https://brainiac.niyogi.hackclub.app",
    "id": "brainiac",
    "lang": "python"
  },
  {
    "des": "The name is pretty self explanatory, its a classic uno game. It has both multiplayer(upto 4 players) and singleplayer(bot). I have implemented custom room generation and a bot to play the game against. The user interface is colorful and intuitive, replicating the feel of physical UNO cards. It uses expressjs for routing, sql for database, and vanilla js for scripting. ",
    "tit": "UNO WEBSITE",
    "git": "https://github.com/hello-lab/uno-website",
    "link": "https://uno.niyogi.hackclub.app/index.html",
    "id": "uno",
    "lang": "nodejs"
  }
]
